### Read, process and write excel files with pandas

In [10]:
!pip3 install xlrd

Collecting xlrd
  Downloading https://files.pythonhosted.org/packages/b0/16/63576a1a001752e34bf8ea62e367997530dc553b689356b9879339cf45a4/xlrd-1.2.0-py2.py3-none-any.whl (103kB)
     |████████████████████████████████| 112kB 2.7MB/s eta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-1.2.0
WARNING: You are using pip version 19.2.2, however version 19.2.3 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [11]:
import pandas as pd
df = pd.read_excel("./sample_data_files/company_data.xlsx", "Sheet1")
df

,"Company information data file, 2019",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,NaN,NaN,NaN,NaN,NaN
1,Company,Number of Employee,Revenue,Stock Price,eps
2,AAA,2006,4005,35,4
3,BPT,23450,400056,67,0.3
4,Colobibi,340,379,342,-1
5,Epson,56,-1,12,13.2
6,Jairon,891,659,N.A.,N.A.
7,McToba,1029,2049,9,7.7

In [14]:
import pandas as pd
df = pd.read_excel("./sample_data_files/company_data.xlsx", "Sheet1", header=2)
df

    Company  Number of Employee  Revenue Stock Price   eps
0       AAA                2006     4005          35     4
1       BPT               23450   400056          67   0.3
2  Colobibi                 340      379         342    -1
3     Epson                  56       -1          12  13.2
4    Jairon                 891      659        N.A.  N.A.
5    McToba                1029     2049           9   7.7

### convert cell values

In [15]:
def convert_NA (cell):
    if cell=='N.A.':
        return None
    return cell

def convert_negative (cell):
    if cell==-1:
        return None
    return cell
df = pd.read_excel("./sample_data_files/company_data.xlsx", "Sheet1", header=2, converters = {
    'Stock Price': convert_NA,
    'eps': convert_NA,
    'Revenue': convert_negative
})
df

    Company  Number of Employee   Revenue  Stock Price   eps
0       AAA                2006    4005.0         35.0   4.0
1       BPT               23450  400056.0         67.0   0.3
2  Colobibi                 340     379.0        342.0  -1.0
3     Epson                  56       NaN         12.0  13.2
4    Jairon                 891     659.0          NaN   NaN
5    McToba                1029    2049.0          9.0   7.7

### write the transformed files to new excel file

In [17]:
df.to_excel("./sample_data_files/company_data_rev.xlsx", sheet_name="companies", startrow=2, startcol=3, index=False)

###  write to csv

In [20]:
df.to_csv("./sample_data_files/company_data_excel.rev.csv", index=False)

### write to multiple excel sheets

In [21]:
df_2 = pd.DataFrame({
    'Season': ['Spring', 'Summer', 'Fall', 'Winter'],
    'Color': ['Green', 'Red', 'Yellow', 'White']
})

In [23]:
with pd.ExcelWriter('./sample_data_files/company_season.xlsx') as writer:
    df.to_excel(writer, sheet_name="companies")
    df_2.to_excel(writer, sheet_name="seasons")